FV2610/E_0533.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.3 | 23.06.2026 (urspr. 01.04.2026) | ebdamame v1.0.0 | rebdhuhn v1.2.0
endfooter

title
GPKE

6.30.3: AD: Bestellung einer Konfiguration vom LF an MSB



end title
:<b>E_0533</b>;
note right
<b><i>Prüfende Rolle: MSB
end note

if (<b>10: </b> Liegt die bestellte Konfiguration zum bestellten Zeitpunkt an der / bzw. allen Lokationen bereits vor?) then (ja)
    :A01;
    note left
        Cluster: Ablehnung
        Die bestellte Konfiguration liegt bereits vor
    endnote
    kill;
else (nein)
endif
if (<b>20: </b> Handelt es sich um eine Bestellung einer kostenfreien Konfiguration?) then (ja)
    if (<b>25: </b> Wurden die Vorlauffristen eingehalten?
Hinweis: Es ist die maximale und die minimale Vorlauffrist zu prüfen.) then (ja)
    else (nein)
        :A08;
        note left
            Cluster: Ablehnung
            Die Vorlauffrist wurde nicht eingehalten.
        endnote
        kill;
    endif
    if (<b>70: </b> Erlaubt die vorhandene Gerätetechnik die Konfiguration zum bestellten Zeitpunkt?) then (ja)
    else (nein)
        :A05;
        note left
            Cluster: Ablehnung
            Die vorhandene Gerätetechnik erlaubt die Konfiguration zum bestellten Zeitpunkt nicht.
            Hinweis:
            Wenn die Gerätetechnik eine detailliertere Auflösung als die bestellten Werte bereitstellt, kann diese nicht abgelehnt werden. 
            Beispiel: Messung bietet Lastgang 1/4h Auflösung. Geforderte Werte sind kumulierte Werte.
        endnote
        kill;
    endif
    if (<b>80: </b> Handelt es sich um die Konfiguration einer Zählzeitdefinition, Schaltzeitdefinition oder Leistungskurvendefinition, welche dem MSB zum bestellten Zeitpunkt nicht bekannt ist?) then (ja)
        :A06;
        note left
            Cluster: Ablehnung
            Bestellte Konfiguration ist dem MSB nicht bekannt
        endnote
        kill;
    else (nein)
    endif
    if (<b>90: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
        :A99;
        note left
            Cluster: Ablehnung
            Sonstiges
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
            Nutzungsmöglichkeit Ende: 01.04.2027 00:00 Uhr
        endnote
        kill;
    else (nein)
        :A07;
        note left
            Cluster: Zustimmung
            Die Einrichtung der Konfiguration ist grundsätzlich möglich
        endnote
        kill;
    endif
else (nein)
    if (<b>30: </b> Liegt bereits eine Konfiguration vom Besteller an der betroffenen Lokation vor?) then (ja)
        if (<b>40: </b> Ist in der Anfrage zum Angebot die Referenz der Bestellung der bestehenden Konfiguration enthalten?
Hinweis:
Wenn bereits an der betreffenden Lokation eine Konfiguration von dem Anfragenden besteht, muss diese Konfiguration beendet werden. Aus diesem Grund gibt der Anfragende die Referenz der bislang geltenden Konfiguration an, da zu einem Zeitpunkt immer nur eine Konfiguration vorhanden sein kann.) then (ja)
        else (nein)
            :A02;
            note left
                Cluster: Ablehnung
                Es besteht an der Lokation bereits eine Konfiguration. In der Anfrage ist die Referenz der bestehenden Konfiguration nicht enthalten.
            endnote
            kill;
        endif
        if (<b>60: </b> Ist das Angebot noch gültig?) then (ja)
        else (nein)
            :A04;
            note left
                Cluster: Ablehnung
                Angebot ist nicht mehr gültig
                (z.B. Angebot ist zu alt, Preise haben sich in der Zwischenzeit geändert&#41;
            endnote
            kill;
        endif
        if (<b>70: </b> Erlaubt die vorhandene Gerätetechnik die Konfiguration zum bestellten Zeitpunkt?) then (ja)
        else (nein)
            :A05;
            note left
                Cluster: Ablehnung
                Die vorhandene Gerätetechnik erlaubt die Konfiguration zum bestellten Zeitpunkt nicht.
                Hinweis:
                Wenn die Gerätetechnik eine detailliertere Auflösung als die bestellten Werte bereitstellt, kann diese nicht abgelehnt werden. 
                Beispiel: Messung bietet Lastgang 1/4h Auflösung. Geforderte Werte sind kumulierte Werte.
            endnote
            kill;
        endif
        if (<b>80: </b> Handelt es sich um die Konfiguration einer Zählzeitdefinition, Schaltzeitdefinition oder Leistungskurvendefinition, welche dem MSB zum bestellten Zeitpunkt nicht bekannt ist?) then (ja)
            :A06;
            note left
                Cluster: Ablehnung
                Bestellte Konfiguration ist dem MSB nicht bekannt
            endnote
            kill;
        else (nein)
        endif
        if (<b>90: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
            :A99;
            note left
                Cluster: Ablehnung
                Sonstiges
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                Nutzungsmöglichkeit Ende: 01.04.2027 00:00 Uhr
            endnote
            kill;
        else (nein)
            :A07;
            note left
                Cluster: Zustimmung
                Die Einrichtung der Konfiguration ist grundsätzlich möglich
            endnote
            kill;
        endif
    else (nein)
    endif
    if (<b>60: </b> Ist das Angebot noch gültig?) then (ja)
    else (nein)
        :A04;
        note left
            Cluster: Ablehnung
            Angebot ist nicht mehr gültig
            (z.B. Angebot ist zu alt, Preise haben sich in der Zwischenzeit geändert&#41;
        endnote
        kill;
    endif
    if (<b>70: </b> Erlaubt die vorhandene Gerätetechnik die Konfiguration zum bestellten Zeitpunkt?) then (ja)
    else (nein)
        :A05;
        note left
            Cluster: Ablehnung
            Die vorhandene Gerätetechnik erlaubt die Konfiguration zum bestellten Zeitpunkt nicht.
            Hinweis:
            Wenn die Gerätetechnik eine detailliertere Auflösung als die bestellten Werte bereitstellt, kann diese nicht abgelehnt werden. 
            Beispiel: Messung bietet Lastgang 1/4h Auflösung. Geforderte Werte sind kumulierte Werte.
        endnote
        kill;
    endif
    if (<b>80: </b> Handelt es sich um die Konfiguration einer Zählzeitdefinition, Schaltzeitdefinition oder Leistungskurvendefinition, welche dem MSB zum bestellten Zeitpunkt nicht bekannt ist?) then (ja)
        :A06;
        note left
            Cluster: Ablehnung
            Bestellte Konfiguration ist dem MSB nicht bekannt
        endnote
        kill;
    else (nein)
    endif
    if (<b>90: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
        :A99;
        note left
            Cluster: Ablehnung
            Sonstiges
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
            Nutzungsmöglichkeit Ende: 01.04.2027 00:00 Uhr
        endnote
        kill;
    else (nein)
        :A07;
        note left
            Cluster: Zustimmung
            Die Einrichtung der Konfiguration ist grundsätzlich möglich
        endnote
        kill;
    endif
endif
if (<b>70: </b> Erlaubt die vorhandene Gerätetechnik die Konfiguration zum bestellten Zeitpunkt?) then (ja)
else (nein)
    :A05;
    note left
        Cluster: Ablehnung
        Die vorhandene Gerätetechnik erlaubt die Konfiguration zum bestellten Zeitpunkt nicht.
        Hinweis:
        Wenn die Gerätetechnik eine detailliertere Auflösung als die bestellten Werte bereitstellt, kann diese nicht abgelehnt werden. 
        Beispiel: Messung bietet Lastgang 1/4h Auflösung. Geforderte Werte sind kumulierte Werte.
    endnote
    kill;
endif
if (<b>80: </b> Handelt es sich um die Konfiguration einer Zählzeitdefinition, Schaltzeitdefinition oder Leistungskurvendefinition, welche dem MSB zum bestellten Zeitpunkt nicht bekannt ist?) then (ja)
    :A06;
    note left
        Cluster: Ablehnung
        Bestellte Konfiguration ist dem MSB nicht bekannt
    endnote
    kill;
else (nein)
endif
if (<b>90: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Cluster: Ablehnung
        Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
        Nutzungsmöglichkeit Ende: 01.04.2027 00:00 Uhr
    endnote
    kill;
else (nein)
    :A07;
    note left
        Cluster: Zustimmung
        Die Einrichtung der Konfiguration ist grundsätzlich möglich
    endnote
    kill;
endif

@enduml
